<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"642befcaa19f76ccaab09a2057dd6878db0fd09ceb862afdc602904e9d00eb13","plan_job_ref":"Job Run Terraform plan in staging #128 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12599518835","plan_out_hash":"d0868ac3d5fe0d38a5fb5bcec662f4f796c19608c566ecf0c0cfc7cdf9cee149","plan_hash":"0fd20f5dbb1689bf408c3299500efa35374894eecee26c0810f98a692dc6de12","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "af51150cd35106926b9402cb72da8002e1490af5362db1f5c8f799acd2f0daaf" -> "e7c0c851594335804de4a0ef9987f14e28f037eff12f69ae058fad0b0b54ae86"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2024-12-26T21:33:03Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #128](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12599518835)